In [13]:
import numpy as np

# Sample student IDs and heights
student_ids = np.array([1023, 5202, 6230, 1671, 1682, 5241, 4532])
heights = np.array([40., 42., 45., 41., 38., 40., 42.0])

# Combine student IDs and heights into a structured array
data = np.array(list(zip(student_ids, heights)), dtype=[('student_id', 'int'), ('height', 'float')])

# Sort the data by height in ascending order
sorted_data = np.sort(data, order='height')

# Extract sorted heights and student IDs
sorted_heights = sorted_data['height']
sorted_student_ids = sorted_data['student_id']

# Print the sorted heights and student IDs separately
print("Sorted Heights:", sorted_heights)
print("Sorted Student IDs:", sorted_student_ids)

Sorted Heights: [38. 40. 40. 41. 42. 42. 45.]
Sorted Student IDs: [1682 1023 5241 1671 4532 5202 6230]

In [1]:
import pandas as pd

In [7]:
df=pd.read_csv("empdata.csv")

In [9]:
df

   Empid           Ename    Salary         DOJ
0   1001          Ganesh   1000.00  10-10-2000
1   1002            Anil  23000.50   3/20/2002
2   1003          Gaurav       NaN  03-03-2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
5   1006          Anant    9999.99  09-09-1999

In [11]:
df.isna().sum()

Empid     0
Ename     0
Salary    1
DOJ       0
dtype: int64

In [17]:
print(df.isna().sum())  # it will display that coloumn   coloumn values has how many null values

Empid     0
Ename     0
Salary    1
DOJ       0
dtype: int64

In [37]:
print(df.dropna(axis=0,inplace=False))  # it will not display the row which has null value ,if inplace=True then it will get

   Empid           Ename    Salary         DOJ
0   1001          Ganesh   1000.00  10-10-2000
1   1002            Anil  23000.50   3/20/2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
5   1006          Anant    9999.99  09-09-1999

In [45]:
print(df) # there are no permanent change smade in this

   Empid           Ename    Salary         DOJ
0   1001          Ganesh   1000.00  10-10-2000
1   1002            Anil  23000.50   3/20/2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
5   1006          Anant    9999.99  09-09-1999